Revit 2024 API
PolyLine Class
A polyline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class PolyLine : GeometryObject
Visual Basic
Public Class PolyLine _
	Inherits GeometryObject
Visual C++
public ref class PolyLine : public GeometryObject
Remarks
A polyline in space is defined by a set of coordinate points.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.PolyLine
See Also
PolyLine Members
Autodesk.Revit.DB Namespace